app/views/recipes/new.html.erb

SELECT "ingredients".* FROM "ingredients"
---
<label>Ingredients:</label><br>
<%= f.collection_check_boxes :ingredient_ids, Ingredient.all, :id, :name %><br><br>