app/views/users/profile.html.erb

 <h4>My Recipes:</h4>
  <% @user.author.recipes.each do |recipe| %>
---
SELECT  "authors".* FROM "authors" WHERE "authors"."user_id" = $1 LIMIT $2  [["user_id", 15], ["LIMIT", 1]]
SELECT "recipes".* FROM "recipes" WHERE "recipes"."author_id" = $1  [["author_id", 2]]


<% if @user.reader.bookmarks.any? %>
---
SELECT  "readers".* FROM "readers" WHERE "readers"."user_id" = $1 LIMIT $2  [["user_id", 11], ["LIMIT", 1]]
SELECT "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."reader_id" = $1  [["reader_id", 8]]
SELECT COUNT(*) FROM "bookmarks" WHERE "bookmarks"."reader_id" = $1  [["reader_id", 78]]