app/views/users/show.html.erb

SELECT  "authors".* FROM "authors" WHERE "authors"."user_id" = $1 LIMIT $2  [["user_id", 3], ["LIMIT", 1]]
SELECT "recipes".* FROM "recipes" WHERE "recipes"."author_id" = $1  [["author_id", 3]]
---
	<label><b>Check out my recipes!</b></label><br>
	<% @user.author.recipes.each do |recipe| %>