app/views/shopping_lists/show.html.erb


<!--<% @shopping_list.line_items.each do |line_item|%>
---
SELECT "line_items".* FROM "line_items" WHERE "line_items"."shopping_list_id" = $1  [["shopping_list_id", 1]]