app/controllers/bookmarks_controller.rb

INSERT INTO "bookmarks" ("recipe_id", "reader_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["recipe_id", 4], ["reader_id", 8], ["created_at", 2016-07-13 21:09:10 UTC], ["updated_at", 2016-07-13 21:09:10 UTC]]
---
	def create

		current_user.reader.bookmarks << Bookmark.create(bookmark_params)