app/controllers/line_items_controller.rb

INSERT INTO "line_items" ("ingredient_id", "created_at", "updated_at", "shopping_list_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["ingredient_id", 88], ["created_at", 2016-07-15 16:06:41 UTC], ["updated_at", 2016-07-15 16:06:41 UTC], ["shopping_list_id", 1]]
---
  def create
    current_user.shopping_list.line_items << LineItem.create(line_item_params)