app/controllers/recipes_controller.rb

SELECT "recipes".* FROM "recipes" WHERE (title like '%poke%')
---
  def index
    @current_user = current_user
    if params[:search]
      @recipes = Recipe.search(params[:search].downcase) + Recipe.search_by_ingredient(params[:search])

SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."recipe_id" = $1  [["recipe_id", 8]]
---
  def show
    @recipe = Recipe.find(params[:id])
    @bookmark = Bookmark.new
    @line_item = LineItem.new
    @review = Review.new
    @reviews = Review.where(recipe_id: @recipe.id)

INSERT INTO "recipes" ("title", "author_id", "content", "image", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "salt chicken"], ["author_id", 1], ["content", "here it is"], ["image", "image"], ["created_at", 2016-07-13 16:49:22 UTC], ["updated_at", 2016-07-13 16:49:22 UTC]]
INSERT INTO "authors" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 4], ["created_at", 2016-07-13 18:04:52 UTC], ["updated_at", 2016-07-13 18:04:52 UTC]]
SELECT  "authors".* FROM "authors" WHERE "authors"."user_id" = $1 LIMIT $2  [["user_id", 4], ["LIMIT", 1]]
INSERT INTO "ingredients" ("id", "name", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["id", 0], ["name", "cucumber"], ["created_at", 2016-07-13 20:44:42 UTC], ["updated_at", 2016-07-13 20:44:42 UTC]]
INSERT INTO "recipe_ingredients" ("ingredient_id", "recipe_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["ingredient_id", 1], ["recipe_id", 4], ["created_at", 2016-07-13 16:52:02 UTC], ["updated_at", 2016-07-13 16:52:02 UTC]]
SELECT  "ingredients".* FROM "ingredients" WHERE "ingredients"."name" = $1 LIMIT $2  [["name", "apple"], ["LIMIT", 1]]
---
  def create
    @recipe = Recipe.new(recipe_params)
    @recipe.categories << Category.create(id: recipe_params[:category_ids])

    @author = Author.find_or_create_by(user_id: session[:user_id])
    @recipe.author = @author
      params[:recipe][:ingredients_attributes].each do |id, name|
        if name[:name] != ""
          @recipe.ingredients << Ingredient.find_or_create_by(name: name[:name])