app/controllers/sessions_controller.rb

  def create
  	if @user = User.find_by(name: params[:name])
---
SELECT  "users".* FROM "users" WHERE "users"."name" = $1 LIMIT $2  [["name", "tom"], ["LIMIT", 1]]