app/controllers/shopping_lists_controller.rb

	def show
		@shopping_list = ShoppingList.find(current_user.shopping_list.id)
---
SELECT  "shopping_lists".* FROM "shopping_lists" WHERE "shopping_lists"."user_id" = $1 LIMIT $2  [["user_id", 92], ["LIMIT", 1]]

	def edit
		@shopping_list = ShoppingList.find(params[:id])
		@shopping_list_uniq = ShoppingList.new
		@shopping_list.distinct_ingredients.to_a.each do |ing|
---
SELECT  "shopping_lists".* FROM "shopping_lists" WHERE "shopping_lists"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
SELECT  "ingredients".* FROM "ingredients" WHERE "ingredients"."id" = $1 LIMIT $2  [["id", 174], ["LIMIT", 1]]

	def create
		  @shopping_list = ShoppingList.find_by(user_id: session[:user_id])
		  @shopping_list.remove_all_items
		  unless params[:shopping_list][:ingredients_attributes] == nil
		  repopulate_shopping_list(@shopping_list)
			end
		  @shopping_list.add_selected_items(params[:shopping_list][:line_items])
		  @shopping_list.save
---
SELECT  "shopping_lists".* FROM "shopping_lists" WHERE "shopping_lists"."user_id" = $1 LIMIT $2  [["user_id", 28], ["LIMIT", 1]]
UPDATE "line_items" SET "shopping_list_id" = NULL WHERE "line_items"."shopping_list_id" = $1  [["shopping_list_id", 10]]

	def update
		byebug
		  @shopping_list = ShoppingList.find(params[:id])
		  @shopping_list.remove_selected_items(params[:shopping_list][:ingredients])
		  @shopping_list.add_selected_items(params[:shopping_list][:line_items])
		  @shopping_list.save
---
SELECT  "shopping_lists".* FROM "shopping_lists" WHERE "shopping_lists"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
UPDATE "line_items" SET "shopping_list_id" = NULL WHERE "line_items"."shopping_list_id" = $1 AND "line_items"."id" = 127  [["shopping_list_id", 10]]

	def delete_all
		@shopping_list = ShoppingList.find_by(user_id: session[:user_id])
---
SELECT  "shopping_lists".* FROM "shopping_lists" WHERE "shopping_lists"."user_id" = $1 LIMIT $2  [["user_id", 28], ["LIMIT", 1]]