app/controllers/users_controller.rb

INSERT INTO "users" ("name", "fav_cuisine", "bio", "image", "allergies", "hometown", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
INSERT INTO "readers" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 10], ["created_at", 2016-07-13 20:33:22 UTC], ["updated_at", 2016-07-13 20:33:22 UTC]]
INSERT INTO "shopping_lists" ("user_id") VALUES ($1) RETURNING "id"  [["user_id", 92]]
---
  def create
    @user = User.create(user_params)
    @user.reader = Reader.create(user_id: @user.id)
    @user.shopping_list = ShoppingList.create(user_id: @user.id)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]
UPDATE "users" SET "fav_cuisine" = $1, "password_digest" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["fav_cuisine", "cuban"], ["password_digest", "$2a$10$TJYTdTbVH1k4wWDhILBDmeN43uuEeVbU.GNLTIrBs5IowtWLPjVQ."], ["updated_at", 2016-07-14 03:20:36 UTC], ["id", 17]]
---
  def update
    @user = User.find(params[:id])
    @user.update(user_params)